Taxi/test_fns_client/requests/register_income_legal.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:SendMessageRequest
        xmlns:ns0="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiAsyncMessageConsumerService/types/1.0">
      <ns0:Message>
        <ns1:PostIncomeRequestV2
            xmlns:ns1="urn://x-artefacts-gnivc-ru/ais3/SMZ/SmzPartnersIntegrationService/types/1.0">
          <ns1:Inn>INN</ns1:Inn>
          <ns1:RequestTime>2021-01-01T00:00:00</ns1:RequestTime>
          <ns1:OperationTime>2021-02-02T00:00:00</ns1:OperationTime>
          <ns1:IncomeType>FROM_LEGAL_ENTITY</ns1:IncomeType>
          <ns1:CustomerInn>CINN</ns1:CustomerInn>
          <ns1:CustomerOrganization>CORG</ns1:CustomerOrganization>
          <ns1:Services>
            <ns1:Amount>100.12</ns1:Amount>
            <ns1:Name>TITLE</ns1:Name>
            <ns1:Quantity>1</ns1:Quantity>
          </ns1:Services>
          <ns1:TotalAmount>100.12</ns1:TotalAmount>
        </ns1:PostIncomeRequestV2>
      </ns0:Message>
    </ns0:SendMessageRequest>
  </soap-env:Body>
</soap-env:Envelope>
